package service;

public class AnimalService {
    // 1.Если в коллекции есть лев, то выведите его возраст, если нет - выбросите исключение IllegalArgumentException

    // 2.Выведите на экран всех животных из коллекции в порядке возрастания их возраста

    // 3.Посчитайте сколько животных в коллекции, у которых возраст больше 4

    // 4.Создайте Map из коллекции животных. Ключ - название животного, значение - экземпляр животного. Выведите все пары ключ-значение в консоль

    // 5.Выведите названия всех животных одной строкой (используйте reduce())

}
